```Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_sns_topic.alarm: Refreshing state... [id=arn:aws:sns:us-east-1:047195220793:ethereum-alarms]
aws_iam_policy.vpc-policy: Refreshing state... [id=arn:aws:iam::047195220793:policy/lambda-vpc]
aws_iam_user.cloudwatch: Refreshing state... [id=cloudwatch-reporter-openethereum]
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_openethereum_lambda]
aws_vpc.default: Refreshing state... [id=vpc-07c85d2103ca609db]
aws_key_pair.deployer: Refreshing state... [id=openethereum-us-east-1-keypair]
aws_api_gateway_rest_api.openethereum: Refreshing state... [id=skntsl9vz4]
data.aws_ami.ubuntu-18_04: Refreshing state...
aws_iam_access_key.cloudwatch: Refreshing state... [id=AKIAQV7IN5M4RX3IANYZ]
aws_iam_user_policy.cloudwatch_role: Refreshing state... [id=cloudwatch-reporter-openethereum:cloudwatch-reporter-policy]
aws_iam_role_policy_attachment.vpc-policy-attach: Refreshing state... [id=serverless_openethereum_lambda-20200730015423872900000001]
aws_api_gateway_resource.proxy: Refreshing state... [id=4n5mj5]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-skntsl9vz4-rvgsdllee7-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-skntsl9vz4-4n5mj5-ANY]
aws_security_group.nat: Refreshing state... [id=sg-0b6760b7daa3c0fda]
aws_subnet.us-east-1a-public: Refreshing state... [id=subnet-0d72a306abbb59873]
aws_internet_gateway.default: Refreshing state... [id=igw-0a83b37498834e663]
aws_security_group.ethereum: Refreshing state... [id=sg-0e23ae62a4a6e9d92]
aws_security_group.lambda: Refreshing state... [id=sg-0218fe52df4af020b]
aws_subnet.us-east-1a-private: Refreshing state... [id=subnet-0a55bfb1a2965c325]
aws_route_table.us-east-1a-public: Refreshing state... [id=rtb-02017a7273548d110]
aws_instance.nat: Refreshing state... [id=i-0747e0712d27705bb]
aws_route_table_association.us-east-1a-public: Refreshing state... [id=rtbassoc-0b9d4f9c5ec095fa9]
data.template_file.ethereum_user_data: Refreshing state...
aws_eip.nat: Refreshing state... [id=eipalloc-0be02cd876d6cef73]
aws_route_table.us-east-1a-private: Refreshing state... [id=rtb-0d380010538774baa]
aws_instance.ethereum[0]: Refreshing state... [id=i-0d05ca8bb6b04a655]
aws_route_table_association.us-east-1a-private: Refreshing state... [id=rtbassoc-07593754bc6b40b34]
aws_cloudwatch_metric_alarm.memory[0]: Refreshing state... [id=openethereum-us-east-1-1-high-mem]
aws_lambda_function.openethereum: Refreshing state... [id=openethereum-monitoring]
aws_cloudwatch_metric_alarm.cpu[0]: Refreshing state... [id=ethereum-us-east-1-1-high-cpu-utilization]
aws_cloudwatch_metric_alarm.disk[0]: Refreshing state... [id=ethereum-us-east-1-1-high-disk-usage]
aws_cloudwatch_metric_alarm.health[0]: Refreshing state... [id=ethereum-us-east-1-1-status-check]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-skntsl9vz4-rvgsdllee7-ANY]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-skntsl9vz4-4n5mj5-ANY]
aws_api_gateway_deployment.openethereum: Refreshing state... [id=3roz92]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.cpu[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "cpu" {
        actions_enabled           = true
        alarm_actions             = [
            "arn:aws:sns:us-east-1:047195220793:ethereum-alarms",
        ]
        alarm_description         = "This metric monitors ec2 cpu utilization"
        alarm_name                = "ethereum-us-east-1-1-high-cpu-utilization"
        arn                       = "arn:aws:cloudwatch:us-east-1:047195220793:alarm:ethereum-us-east-1-1-high-cpu-utilization"
        comparison_operator       = "GreaterThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "InstanceId" = "i-0d05ca8bb6b04a655"
        } -> (known after apply)
        evaluation_periods        = 1
        id                        = "ethereum-us-east-1-1-high-cpu-utilization"
        insufficient_data_actions = []
        metric_name               = "CPUUtilization"
        namespace                 = "AWS/EC2"
        ok_actions                = []
        period                    = 3600
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 80
        treat_missing_data        = "missing"
    }

  # aws_cloudwatch_metric_alarm.disk[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "disk" {
        actions_enabled           = true
        alarm_actions             = [
            "arn:aws:sns:us-east-1:047195220793:ethereum-alarms",
        ]
        alarm_description         = "This metric monitors the disk space holding the blockchain data"
        alarm_name                = "ethereum-us-east-1-1-high-disk-usage"
        arn                       = "arn:aws:cloudwatch:us-east-1:047195220793:alarm:ethereum-us-east-1-1-high-disk-usage"
        comparison_operator       = "GreaterThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "ImageId"      = "ami-03a2cbdcd9e7d1955"
          - "InstanceId"   = "i-0d05ca8bb6b04a655"
          - "InstanceType" = "t2.micro"
          - "device"       = "xvda1"
          - "fstype"       = "ext4"
          - "path"         = "/"
        } -> (known after apply)
        evaluation_periods        = 1
        id                        = "ethereum-us-east-1-1-high-disk-usage"
        insufficient_data_actions = []
        metric_name               = "disk_used_percent"
        namespace                 = "CWAgent"
        ok_actions                = []
        period                    = 60
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 80
        treat_missing_data        = "missing"
    }

  # aws_cloudwatch_metric_alarm.health[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "health" {
        actions_enabled           = true
        alarm_actions             = [
            "arn:aws:sns:us-east-1:047195220793:ethereum-alarms",
        ]
        alarm_description         = "This metric monitors ec2 health status"
        alarm_name                = "ethereum-us-east-1-1-status-check"
        arn                       = "arn:aws:cloudwatch:us-east-1:047195220793:alarm:ethereum-us-east-1-1-status-check"
        comparison_operator       = "GreaterThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "InstanceId" = "i-0d05ca8bb6b04a655"
        } -> (known after apply)
        evaluation_periods        = 1
        id                        = "ethereum-us-east-1-1-status-check"
        insufficient_data_actions = []
        metric_name               = "StatusCheckFailed"
        namespace                 = "AWS/EC2"
        ok_actions                = []
        period                    = 3600
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 1
        treat_missing_data        = "missing"
    }

  # aws_cloudwatch_metric_alarm.memory[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "memory" {
        actions_enabled           = true
        alarm_actions             = [
            "arn:aws:sns:us-east-1:047195220793:ethereum-alarms",
        ]
        alarm_description         = "This metric monitors EC2 Memory utilization"
        alarm_name                = "openethereum-us-east-1-1-high-mem"
        arn                       = "arn:aws:cloudwatch:us-east-1:047195220793:alarm:openethereum-us-east-1-1-high-mem"
        comparison_operator       = "GreaterThanOrEqualToThreshold"
        datapoints_to_alarm       = 0
      ~ dimensions                = {
          - "ImageId"      = "ami-03a2cbdcd9e7d1955"
          - "InstanceId"   = "i-0d05ca8bb6b04a655"
          - "InstanceType" = "t2.micro"
        } -> (known after apply)
        evaluation_periods        = 1
        id                        = "openethereum-us-east-1-1-high-mem"
        insufficient_data_actions = []
        metric_name               = "mem_used_percent"
        namespace                 = "CWAgent"
        ok_actions                = []
        period                    = 3600
        statistic                 = "Average"
        tags                      = {}
        threshold                 = 75
        treat_missing_data        = "missing"
    }

  # aws_instance.ethereum[0] must be replaced
-/+ resource "aws_instance" "ethereum" {
        ami                          = "ami-03a2cbdcd9e7d1955"
      ~ arn                          = "arn:aws:ec2:us-east-1:047195220793:instance/i-0d05ca8bb6b04a655" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
        availability_zone            = "us-east-1a"
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
        get_password_data            = false
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-0d05ca8bb6b04a655" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "t2.micro"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
        key_name                     = "openethereum-us-east-1-keypair"
      - monitoring                   = false -> null
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-058875c72a1be38ae" -> (known after apply)
      ~ private_dns                  = "ip-10-0-1-35.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.0.1.35" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = false
        subnet_id                    = "subnet-0a55bfb1a2965c325"
        tags                         = {
            "Name" = "openethereum-instance"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data                    = "b4dab224ac6425863faa148d5c26f16583c026a4" -> "0e9b004ed5a4af7371af8b455bf938eca87dadf0" # forces replacement
      ~ volume_tags                  = {} -> (known after apply)
        vpc_security_group_ids       = [
            "sg-0e23ae62a4a6e9d92",
        ]

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
            delete_on_termination = true
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 150 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ volume_id             = "vol-0943258c97edbf236" -> (known after apply)
            volume_size           = 50
            volume_type           = "gp2"
        }
    }

  # aws_lambda_function.openethereum will be updated in-place
  ~ resource "aws_lambda_function" "openethereum" {
        arn                            = "arn:aws:lambda:us-east-1:047195220793:function:openethereum-monitoring"
        function_name                  = "openethereum-monitoring"
        handler                        = "main.handler"
        id                             = "openethereum-monitoring"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:047195220793:function:openethereum-monitoring/invocations"
        last_modified                  = "2020-07-30T02:35:10.729+0000"
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:047195220793:function:openethereum-monitoring:5"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::047195220793:role/serverless_openethereum_lambda"
        runtime                        = "nodejs12.x"
        s3_bucket                      = "ethereum-lambda-monitoring"
        s3_key                         = "openethereum.zip"
        source_code_hash               = "S22842npeeengAjMx4svFBIiiu8QOSaRoYG1+wtRwt0="
        source_code_size               = 143054
        tags                           = {}
        timeout                        = 3
        version                        = "5"

      ~ environment {
          ~ variables = {
              - "RPC_ENDPOINT" = "10.0.1.35:8545"
            } -> (known after apply)
        }

        tracing_config {
            mode = "PassThrough"
        }

        vpc_config {
            security_group_ids = [
                "sg-0218fe52df4af020b",
            ]
            subnet_ids         = [
                "subnet-0d72a306abbb59873",
            ]
            vpc_id             = "vpc-07c85d2103ca609db"
        }
    }

Plan: 1 to add, 5 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```